#author:lpw
#date:
menu={
    "家电":{
        "冰箱":{"海尔":"￥4500/台","创维":"￥5000/台"},
        "洗衣机":{"全自动":"￥4700/台","半自动":"￥3600/台"},
        "电视":{"创维":"￥5890/台","乐视":"￥5930/台"}
    },
    "衣服":{
        "上衣":{"衬衣":"￥86/件","毛衣":"￥50/件","羽绒服":"￥500/件"},
        "下衣":{"牛仔裤":"￥150/件","休闲裤":"￥200/件"},
        "鞋":{"滑板鞋":"￥300/双","足球鞋":"￥348/双"}
    },
    "手机":{
        "联通":{"华为":"￥2300/部","小米":"￥860/部"},
        "电信":{"华为":"￥2290/部","小米":"￥860/部"},
        "移动":{"华为":"￥2300/部","小米":"￥870/部"}
    },
    "车":{
        "自行车":{"moble":"￥399/辆","ofs":"￥99/辆"},
        "电动车":{"爱马仕":"￥1300/辆","小鸟":"￥1200/辆"},
        "汽车":{"宝马":"￥230000/辆","奔驰":"￥299999/辆"}
    },
    "食物":{
        "零食":{"爆米花":"￥10/包","口香糖":"￥5/包"},
        "餐饮":{"小米":"￥20/kg","大米":"￥80/袋"}
    }
}


while True:
    for i in menu:
        print(i)  #输出一级菜单
    choice1= input("输入一级类别进入二级目录,输入“q”退出程序：")
    if choice1 in menu:
        for i in menu[choice1]:
            print(i)  #输出二级菜单
        while True:
            choice2=input("输入二级类别进入三级目录，返回请按“b”：")
            if choice2 in menu[choice1]:
                for j in menu[choice1][choice2]:
                    print(j+":"+menu[choice1][choice2][j])
                choice_back=input("最后一层，返回请按“b”：")
                if choice_back == "b":
                    for m in menu[choice1]:
                        print(m)
                    continue
                    # choice2=input("输入类别进入下层目录，返回请按“b”：")
            elif choice2 == "b":
                break
            else:
                print("输入错误，程序退出")
                exit(2)
    elif choice1 == "q":
        print("退出程序")
        exit(2)
    else:
        break



